## Preparar a Semente, Torrar o Café

###  Tratamento dos Dados

<b> 1. Introdução: </b>

<b> 1.1. Problema: </b>

A partir de um dataset disponibilizado, será realizado um tratamento e ajuste de modo que tenhamos um dataset no formato de linha, coluna

<b> 1.2. Dataset: </b>

Este dataset é projeto num formato de uma matriz multidimensional

<b> 1.3. Objetivo: </b>
    
Gerar um dataset no formato csv para ser posteriormente usado num modelo de aprendizagem de máquinas, suportado pelo objeto dataframe da biblioteca pandas

<b> 2. Codificação - Tratamento do Arquivo </b>

<b> 2.1 Função especial para o tratamento de linhas </b>

In [1]:
def tratar_line(line):
    line = line.replace("\t",";")
    line = line.replace('"','')
    line = line.replace('\n','')  
    line = line.replace('.','')
    line = line.replace(',','.')
    return line

In [2]:
line_meses = ""
lista      = []
line_valor = ""
i = 0
f = open("../data/tab_cooxupe.txt", "r")
for x in f:
    if i == 0 :
        line_meses = x
    if i > 0 :  
        line_valor = x
        lista.append(tratar_line(line_valor))
    i = i +1

In [3]:
line_meses= line_meses.replace("\t",";")
line_meses= line_meses.replace('"','')
line_meses= line_meses.replace('\n','')
line_meses= line_meses.replace('Ano;','')

In [4]:
line_meses.split(';')

['Janeiro',
 'Fevereiro',
 'Marco',
 'Abril',
 'Maio',
 'Junho',
 'Julho',
 'Agosto',
 'Setembro',
 'Outubro',
 'Novembro',
 'Dezembro']

In [5]:
line_valor

'"1981"\t"6.336,11"\t"6.563,57"\t"6.421,42"\t"6.421,42"\t"6.411,71"\t"6.207,21"\t"6.533,26"\t"7.455,29"\t"7.601,47"\t"7.814,22"\t"8.670,28"\t"10.055,01"'

In [6]:
line_valor= line_valor.replace("\t",";")
line_valor= line_valor.replace('"','')
line_valor= line_valor.replace('\n','')
line_valor

'1981;6.336,11;6.563,57;6.421,42;6.421,42;6.411,71;6.207,21;6.533,26;7.455,29;7.601,47;7.814,22;8.670,28;10.055,01'

In [7]:
len(lista)

43

In [8]:
import pandas as pd

In [12]:
import warnings
warnings.filterwarnings("ignore")

In [13]:
matriz = []
vetor  = []
data   = []
col_names =  ['data', 'valor']
df  = pd.DataFrame(columns = col_names)
for l in lista:
    vetor = l.split(';')
    j = 0
    for v in vetor:
        if j == 0:
            ano = v
        else:
            mes = j  
            if len(v) == 0:
                valor = 0
            else:
                valor = v
            data_valor = str(ano) + '_' + str(mes) + ';'+ str(valor)
            if j > 0 :
                values = data_valor.split(';')
                df = df.append({'data': values[0], 'valor': values[1]}, ignore_index=True)
                data.append(data_valor)   
        j = j + 1

In [14]:
df.head()

     data    valor
0  2023_1  1030.14
1  2023_2  1130.26
2  2023_3  1103.37
3  2023_4  1115.24
4  2023_5  1030.64

In [15]:
df.head(20)

       data    valor
0    2023_1  1030.14
1    2023_2  1130.26
2    2023_3  1103.37
3    2023_4  1115.24
4    2023_5  1030.64
5    2023_6        0
6    2023_7        0
7    2023_8        0
8    2023_9        0
9   2023_10        0
10  2023_11        0
11  2023_12        0
12   2022_1  1480.49
13   2022_2  1488.11
14   2022_3  1258.22
15   2022_4  1253.25
16   2022_5  1259.21
17   2022_6  1256.28
18   2022_7  1119.45
19   2022_8  1075.91

In [16]:
df.to_csv('../data/tab_cooxupe.csv',index=None)